<a href="https://colab.research.google.com/github/antonioravila/Alura-Cursos/blob/main/Python_Pandas_tratando_e_analisando_dados_(PT3).ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Relatório de Análise V

## Tratamento de dados faltantes

In [ ]:
import pandas as pd

In [ ]:
dados = pd.read_csv('/content/aluguel_residencial.csv', sep = ';')

In [ ]:
dados.head(10)

                 Tipo           Bairro  Quartos  ...    Valor  Condominio  IPTU
0           Quitinete       Copacabana        1  ...   1700.0       500.0  60.0
1                Casa  Jardim Botânico        2  ...   7000.0         NaN   NaN
2         Apartamento           Centro        1  ...    800.0       390.0  20.0
3         Apartamento     Higienópolis        1  ...    800.0       230.0   NaN
4         Apartamento     Vista Alegre        3  ...   1200.0         NaN   NaN
5         Apartamento         Cachambi        2  ...   1300.0       301.0  17.0
6  Casa de Condomínio  Barra da Tijuca        5  ...  22000.0         NaN   NaN
7  Casa de Condomínio            Ramos        2  ...   1000.0         NaN   NaN
8         Apartamento           Centro        1  ...   1200.0         NaN   NaN
9         Apartamento           Grajaú        2  ...   1500.0       642.0  74.0

[10 rows x 9 columns]

In [ ]:
# as duas funções abaixo retornam dataframes com valores booleanos
# isso acontece de acordo com a presença de valores "null"

In [ ]:
dados.isnull()

        Tipo  Bairro  Quartos  Vagas  Suites   Area  Valor  Condominio   IPTU
0      False   False    False  False   False  False  False       False  False
1      False   False    False  False   False  False  False        True   True
2      False   False    False  False   False  False  False       False  False
3      False   False    False  False   False  False  False       False   True
4      False   False    False  False   False  False  False        True   True
...      ...     ...      ...    ...     ...    ...    ...         ...    ...
22575  False   False    False  False   False  False  False       False  False
22576  False   False    False  False   False  False  False       False  False
22577  False   False    False  False   False  False  False       False  False
22578  False   False    False  False   False  False  False       False  False
22579  False   False    False  False   False  False  False       False   True

[22580 rows x 9 columns]

In [ ]:
dados.notnull()

       Tipo  Bairro  Quartos  Vagas  Suites  Area  Valor  Condominio   IPTU
0      True    True     True   True    True  True   True        True   True
1      True    True     True   True    True  True   True       False  False
2      True    True     True   True    True  True   True        True   True
3      True    True     True   True    True  True   True        True  False
4      True    True     True   True    True  True   True       False  False
...     ...     ...      ...    ...     ...   ...    ...         ...    ...
22575  True    True     True   True    True  True   True        True   True
22576  True    True     True   True    True  True   True        True   True
22577  True    True     True   True    True  True   True        True   True
22578  True    True     True   True    True  True   True        True   True
22579  True    True     True   True    True  True   True        True  False

[22580 rows x 9 columns]

In [ ]:
"""
Essa função .info() retorna várias informações sobre o dataframe
nota-se portanto, que essa função nos informa a quantidade de valores não nulos em
cada coluna.

"Non-null count"
"""
dados.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 22580 entries, 0 to 22579
Data columns (total 9 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Tipo        22580 non-null  object
 1   Bairro      22580 non-null  object
 2   Quartos     22580 non-null  int64
 3   Vagas       22580 non-null  int64
 4   Suites      22580 non-null  int64
 5   Area        22580 non-null  int64
 6   Valor       22571 non-null  float64
 7   Condominio  20765 non-null  float64
 8   IPTU        15795 non-null  float64
dtypes: float64(3), int64(4), object(2)
memory usage: 1.6+ MB

In [ ]:
# é importante lembrar que o colchete aqui está servindo como um selecionador
# estamos vendo as linhas com os valores nulos na coluna "Valor"
dados[dados['Valor'].isnull()]

             Tipo           Bairro  Quartos  ...  Valor  Condominio   IPTU
58    Apartamento  Barra da Tijuca        2  ...    NaN       970.0   68.0
1492  Apartamento             Leme        2  ...    NaN       878.0    NaN
1683         Casa     Campo Grande        3  ...    NaN         NaN    NaN
2012  Apartamento         Botafogo        2  ...    NaN      1010.0  170.0
2034  Apartamento       Copacabana        2  ...    NaN       850.0    NaN
4941         Casa     Campo Grande        3  ...    NaN         NaN    NaN
8568  Apartamento             Leme        2  ...    NaN       878.0    NaN
8947  Apartamento           Glória        3  ...    NaN       910.0  228.0
9149  Apartamento            Gávea        3  ...    NaN       880.0  221.0

[9 rows x 9 columns]

In [ ]:
"""
Essa função elimina os valores nulos em uma determinada coluna
O primeiro parametro seleciona a coluna que sera utilizada
o segundo parametro, se True, já torna permanente as mudanças dentro do 
dataframe utilizado originalmente na função
"""
dados.dropna(subset=['Valor'], inplace=True)

In [ ]:
# Assim podemos checar se a função funcionou
dados[dados['Valor'].isnull()]

Empty DataFrame
Columns: [Tipo, Bairro, Quartos, Vagas, Suites, Area, Valor, Condominio, IPTU]
Index: []

## Tratamento de dados faltantes (continuação)

In [ ]:
# nota-se que ainda existem valores nulos nas colunas Condominio e IPTU
dados.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 22571 entries, 0 to 22579
Data columns (total 9 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Tipo        22571 non-null  object
 1   Bairro      22571 non-null  object
 2   Quartos     22571 non-null  int64
 3   Vagas       22571 non-null  int64
 4   Suites      22571 non-null  int64
 5   Area        22571 non-null  int64
 6   Valor       22571 non-null  float64
 7   Condominio  20758 non-null  float64
 8   IPTU        15791 non-null  float64
dtypes: float64(3), int64(4), object(2)
memory usage: 1.7+ MB

In [ ]:
# Quantos condominios nulos temos?
dados[dados['Condominio'].isnull()].shape[0]

1813

In [ ]:
"""
Sendo assim, vamos criar uma seleção
essa deve conter os valores nulos de condominios somente em apartamentos
casas e outros tipos de imóveis não pagam condominio, deixando clara a razão 
do valor nulo
"""
selecao = (dados['Tipo'] == 'Apartamento') & (dados['Condominio'].isnull())

In [ ]:
"""
- Aqui o objetivo é apagar os valores da seleção
- dessa maneira, primeiramente, na variavel A, foi armazenado a quantidade 
de linhas do primeiro dataframe. 
- Na variavel B, foi armazenado a quantidade de linhas do dataframe após apagar 
os itens da seleção
- É importante também lembrar que o sinal '~' foi utilizado como maneira de 
reverter os valores da seleção dentro do dataframe, selecionando assim somente os que não fazem parte da seleção prévia
"""
A = dados.shape[0]
dados = dados[~selecao]
B = dados.shape[0]
A - B

745

In [ ]:
# a diferença pode ser vista aqui também
dados[dados['Condominio'].isnull()].shape[0]

1068

In [ ]:
# Ainda existem valores nulos em Condominio e IPTU.
# Sendo assim, ao invés de apaga-los, vamos atribuir um valor a eles
dados.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 21826 entries, 0 to 22579
Data columns (total 9 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Tipo        21826 non-null  object
 1   Bairro      21826 non-null  object
 2   Quartos     21826 non-null  int64
 3   Vagas       21826 non-null  int64
 4   Suites      21826 non-null  int64
 5   Area        21826 non-null  int64
 6   Valor       21826 non-null  float64
 7   Condominio  20758 non-null  float64
 8   IPTU        15685 non-null  float64
dtypes: float64(3), int64(4), object(2)
memory usage: 1.7+ MB

In [ ]:
"""
essa função subtitui todos os valores nulos por um valor determinado
podemos utiliza-la de duas diferente maneiras: 

dados.fillna(0, inplace = True)

dados.fillna({'Condominio': 0, 'IPTU': 0}, inplace = True)

A primeira somente admite um valor para todos valores nulos, já a segunda 
subtitui de acordo com cada coluna

"""

dados.fillna({'Condominio': 0, 'IPTU': 0}, inplace = True)

In [ ]:
dados.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 21826 entries, 0 to 22579
Data columns (total 9 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Tipo        21826 non-null  object
 1   Bairro      21826 non-null  object
 2   Quartos     21826 non-null  int64
 3   Vagas       21826 non-null  int64
 4   Suites      21826 non-null  int64
 5   Area        21826 non-null  int64
 6   Valor       21826 non-null  float64
 7   Condominio  21826 non-null  float64
 8   IPTU        21826 non-null  float64
dtypes: float64(3), int64(4), object(2)
memory usage: 1.7+ MB

In [ ]:
dados[dados['Condominio'].isnull()].shape[0]

0

In [ ]:
dados[dados['IPTU'].isnull()].shape[0]

0

In [ ]:
# Após esse tratamento, preciso tranformar os dados em um arquivo .csv
dados.to_csv('/content/aluguel_residencial_tratado.csv', sep = ';', index = False)

## Exercício

In [ ]:
imoveis = pd.DataFrame([['Apartamento', None, 970, 68], 
                        ['Apartamento', 2000, 878, 112], 
                        ['Casa', 5000, None, 500], 
                        ['Apartamento', None, 1010, 170], 
                        ['Apartamento', 1500, 850, None], 
                        ['Casa', None, None, None], 
                        ['Apartamento', 2000, 878, None], 
                        ['Apartamento', 1550, None, 228], 
                        ['Apartamento', 2500, 880, 195]], 
                        columns = ['Tipo', 'Valor', 'Condominio', 'IPTU'])

In [ ]:
imoveis

          Tipo   Valor  Condominio   IPTU
0  Apartamento     NaN       970.0   68.0
1  Apartamento  2000.0       878.0  112.0
2         Casa  5000.0         NaN  500.0
3  Apartamento     NaN      1010.0  170.0
4  Apartamento  1500.0       850.0    NaN
5         Casa     NaN         NaN    NaN
6  Apartamento  2000.0       878.0    NaN
7  Apartamento  1550.0         NaN  228.0
8  Apartamento  2500.0       880.0  195.0

In [ ]:
imoveis.dropna(subset = ['Valor'], inplace = True)
imoveis

          Tipo   Valor  Condominio   IPTU
1  Apartamento  2000.0       878.0  112.0
2         Casa  5000.0         NaN  500.0
4  Apartamento  1500.0       850.0    NaN
6  Apartamento  2000.0       878.0    NaN
7  Apartamento  1550.0         NaN  228.0
8  Apartamento  2500.0       880.0  195.0

In [ ]:
selecao = (imoveis['Tipo'] == 'Apartamento') & (imoveis['Condominio'].isnull())
imoveis = imoveis[~selecao]
imoveis

          Tipo   Valor  Condominio   IPTU
1  Apartamento  2000.0       878.0  112.0
2         Casa  5000.0         NaN  500.0
4  Apartamento  1500.0       850.0    NaN
6  Apartamento  2000.0       878.0    NaN
8  Apartamento  2500.0       880.0  195.0

In [ ]:
imoveis = imoveis.fillna({'Condominio': 0, 'IPTU': 0})
imoveis

          Tipo   Valor  Condominio   IPTU
1  Apartamento  2000.0       878.0  112.0
2         Casa  5000.0         0.0  500.0
4  Apartamento  1500.0       850.0    0.0
6  Apartamento  2000.0       878.0    0.0
8  Apartamento  2500.0       880.0  195.0

In [ ]:
imoveis.index = range(imoveis.shape[0])
imoveis

          Tipo   Valor  Condominio   IPTU
0  Apartamento  2000.0       878.0  112.0
1         Casa  5000.0         0.0  500.0
2  Apartamento  1500.0       850.0    0.0
3  Apartamento  2000.0       878.0    0.0
4  Apartamento  2500.0       880.0  195.0

## (Extra) Métodos de interpolação

In [ ]:
data = [0.5, None, None, 0.52, 0.54, None, None, 0.59, 0.6, None, 0.7]
s = pd.Series(data)

In [ ]:
s

0     0.50
1      NaN
2      NaN
3     0.52
4     0.54
5      NaN
6      NaN
7     0.59
8     0.60
9      NaN
10    0.70
dtype: float64

In [ ]:
s.fillna(0)

0     0.50
1     0.00
2     0.00
3     0.52
4     0.54
5     0.00
6     0.00
7     0.59
8     0.60
9     0.00
10    0.70
dtype: float64

In [ ]:
# nesse método, sempre o número anterior, se válido, vai substituir o nulo
s.fillna(method = 'ffill')

0     0.50
1     0.50
2     0.50
3     0.52
4     0.54
5     0.54
6     0.54
7     0.59
8     0.60
9     0.60
10    0.70
dtype: float64

In [ ]:
# esse método faz o mesmo que o anterior, só que de baixo para cima
s.fillna(method = 'bfill')

0     0.50
1     0.52
2     0.52
3     0.52
4     0.54
5     0.59
6     0.59
7     0.59
8     0.60
9     0.70
10    0.70
dtype: float64

In [ ]:
s

0     0.50
1      NaN
2      NaN
3     0.52
4     0.54
5      NaN
6      NaN
7     0.59
8     0.60
9      NaN
10    0.70
dtype: float64

In [ ]:
# O parametro limit define a quantidade máxima de valores consecutivos substituidos
s.fillna(method = 'bfill', limit = 1)

0     0.50
1      NaN
2     0.52
3     0.52
4     0.54
5      NaN
6     0.59
7     0.59
8     0.60
9     0.70
10    0.70
dtype: float64

# Relatório de Análise VI

## Criando novas variáveis

In [ ]:
dados.head()

          Tipo           Bairro  Quartos  Vagas  ...  Area   Valor  Condominio  IPTU
0    Quitinete       Copacabana        1      0  ...    40  1700.0       500.0  60.0
1         Casa  Jardim Botânico        2      0  ...   100  7000.0         0.0   0.0
2  Apartamento           Centro        1      0  ...    15   800.0       390.0  20.0
3  Apartamento     Higienópolis        1      0  ...    48   800.0       230.0   0.0
5  Apartamento         Cachambi        2      0  ...    50  1300.0       301.0  17.0

[5 rows x 9 columns]

In [ ]:
# criei uma nova coluna com a soma dessas outras três
dados['Valor Bruto'] = dados['Valor'] + dados['Condominio'] + dados['IPTU']

In [ ]:
dados.head()

          Tipo           Bairro  Quartos  ...  Condominio  IPTU  Valor Bruto
0    Quitinete       Copacabana        1  ...       500.0  60.0       2260.0
1         Casa  Jardim Botânico        2  ...         0.0   0.0       7000.0
2  Apartamento           Centro        1  ...       390.0  20.0       1210.0
3  Apartamento     Higienópolis        1  ...       230.0   0.0       1030.0
5  Apartamento         Cachambi        2  ...       301.0  17.0       1618.0

[5 rows x 10 columns]

In [ ]:
dados['Valor m2'] = dados['Valor'] / dados['Area']

In [ ]:
# muitas casas decimais
dados.head()

          Tipo           Bairro  Quartos  ...  IPTU  Valor Bruto   Valor m2
0    Quitinete       Copacabana        1  ...  60.0       2260.0  42.500000
1         Casa  Jardim Botânico        2  ...   0.0       7000.0  70.000000
2  Apartamento           Centro        1  ...  20.0       1210.0  53.333333
3  Apartamento     Higienópolis        1  ...   0.0       1030.0  16.666667
5  Apartamento         Cachambi        2  ...  17.0       1618.0  26.000000

[5 rows x 11 columns]

In [ ]:
dados['Valor m2'] = dados['Valor m2'].round(2)

In [ ]:
dados.head()

          Tipo           Bairro  Quartos  ...  IPTU  Valor Bruto  Valor m2
0    Quitinete       Copacabana        1  ...  60.0       2260.0     42.50
1         Casa  Jardim Botânico        2  ...   0.0       7000.0     70.00
2  Apartamento           Centro        1  ...  20.0       1210.0     53.33
3  Apartamento     Higienópolis        1  ...   0.0       1030.0     16.67
5  Apartamento         Cachambi        2  ...  17.0       1618.0     26.00

[5 rows x 11 columns]

In [ ]:
dados['Valor Bruto m2'] = (dados['Valor Bruto']/dados['Area']).round(2)

In [ ]:
dados.head()

          Tipo           Bairro  Quartos  ...  Valor Bruto  Valor m2  Valor Bruto m2
0    Quitinete       Copacabana        1  ...       2260.0     42.50           56.50
1         Casa  Jardim Botânico        2  ...       7000.0     70.00           70.00
2  Apartamento           Centro        1  ...       1210.0     53.33           80.67
3  Apartamento     Higienópolis        1  ...       1030.0     16.67           21.46
5  Apartamento         Cachambi        2  ...       1618.0     26.00           32.36

[5 rows x 12 columns]

In [ ]:
dados['Tipo'].value_counts()

Apartamento           18780
Casa de Condomínio      996
Casa                    965
Quitinete               836
Casa de Vila            249
Name: Tipo, dtype: int64

In [ ]:
# Agora aqui o objetivo é separar por tipo agregado, separando por casa e ap
casa = ['Casa', 'Casa de Vila', 'Casa de Condomínio']

In [ ]:
# A função '.apply()' aplica uma função para cada registro do df
dados['Tipo Agregado'] = dados['Tipo'].apply(lambda x: 'Casa' if x in casa else 'Apartamento' )

In [ ]:
dados.head(10)

                  Tipo               Bairro  ...  Valor Bruto m2  Tipo Agregado
0            Quitinete           Copacabana  ...           56.50    Apartamento
1                 Casa      Jardim Botânico  ...           70.00           Casa
2          Apartamento               Centro  ...           80.67    Apartamento
3          Apartamento         Higienópolis  ...           21.46    Apartamento
5          Apartamento             Cachambi  ...           32.36    Apartamento
6   Casa de Condomínio      Barra da Tijuca  ...           29.33           Casa
7   Casa de Condomínio                Ramos  ...           15.38           Casa
9          Apartamento               Grajaú  ...           31.66    Apartamento
10         Apartamento  Lins de Vasconcelos  ...           21.88    Apartamento
11         Apartamento           Copacabana  ...           65.28    Apartamento

[10 rows x 13 columns]

## Exercício

In [ ]:
alunos = pd.DataFrame({'Nome': ['Ary', 'Cátia', 'Denis', 'Beto', 'Bruna', 'Dara', 'Carlos', 'Alice'], 
                        'Sexo': ['M', 'F', 'M', 'M', 'F', 'F', 'M', 'F'], 
                        'Idade': [15, 27, 56, 32, 42, 21, 19, 35], 
                        'Notas': [7.5, 2.5, 5.0, 10, 8.2, 7, 6, 5.6]}, 
                        columns = ['Nome', 'Idade', 'Sexo', 'Notas'])

In [ ]:
alunos

     Nome  Idade Sexo  Notas
0     Ary     15    M    7.5
1   Cátia     27    F    2.5
2   Denis     56    M    5.0
3    Beto     32    M   10.0
4   Bruna     42    F    8.2
5    Dara     21    F    7.0
6  Carlos     19    M    6.0
7   Alice     35    F    5.6

In [ ]:
alunos['Notas-Média(Notas)'] = alunos['Notas'].apply(lambda x: x - alunos['Notas'].mean())

In [ ]:
alunos

     Nome  Idade Sexo  Notas  Notas-Média(Notas)
0     Ary     15    M    7.5               1.025
1   Cátia     27    F    2.5              -3.975
2   Denis     56    M    5.0              -1.475
3    Beto     32    M   10.0               3.525
4   Bruna     42    F    8.2               1.725
5    Dara     21    F    7.0               0.525
6  Carlos     19    M    6.0              -0.475
7   Alice     35    F    5.6              -0.875

In [ ]:
alunos['Faixa Etária'] = alunos['Idade'].apply(lambda x: 'Menor que 20 anos' if x < 20 else ('Entre 20 e 40 anos' if (x >= 20 and x <= 40) else 'Maior que 40 anos'))

In [ ]:
alunos

     Nome  Idade Sexo  Notas  Notas-Média(Notas)        Faixa Etária
0     Ary     15    M    7.5               1.025   Menor que 20 anos
1   Cátia     27    F    2.5              -3.975  Entre 20 e 40 anos
2   Denis     56    M    5.0              -1.475   Maior que 40 anos
3    Beto     32    M   10.0               3.525  Entre 20 e 40 anos
4   Bruna     42    F    8.2               1.725   Maior que 40 anos
5    Dara     21    F    7.0               0.525  Entre 20 e 40 anos
6  Carlos     19    M    6.0              -0.475   Menor que 20 anos
7   Alice     35    F    5.6              -0.875  Entre 20 e 40 anos

## Excluindo variáveis

In [ ]:
dados_aux = pd.DataFrame(dados[['Tipo Agregado', 'Valor m2', 'Valor Bruto', 'Valor Bruto m2']])

In [ ]:
dados_aux.head()

  Tipo Agregado  Valor m2  Valor Bruto  Valor Bruto m2
0   Apartamento     42.50       2260.0           56.50
1          Casa     70.00       7000.0           70.00
2   Apartamento     53.33       1210.0           80.67
3   Apartamento     16.67       1030.0           21.46
5   Apartamento     26.00       1618.0           32.36

In [ ]:
del dados_aux['Valor Bruto']

In [ ]:
dados_aux.head()

  Tipo Agregado  Valor m2  Valor Bruto m2
0   Apartamento     42.50           56.50
1          Casa     70.00           70.00
2   Apartamento     53.33           80.67
3   Apartamento     16.67           21.46
5   Apartamento     26.00           32.36

In [ ]:
dados_aux.pop('Valor Bruto m2')

0        56.50
1        70.00
2        80.67
3        21.46
5        32.36
         ...
22575    20.54
22576    43.52
22577    33.85
22578    40.54
22579    53.71
Name: Valor Bruto m2, Length: 21826, dtype: float64

In [ ]:
dados_aux.head()

  Tipo Agregado  Valor m2
0   Apartamento     42.50
1          Casa     70.00
2   Apartamento     53.33
3   Apartamento     16.67
5   Apartamento     26.00

In [ ]:
# Aqui precisamos colocar o parametro axis = 1, para identificar que são as colunas que desejamos apagar
dados.drop(['Valor Bruto', 'Valor Bruto m2'], axis=1, inplace=True)

In [ ]:
dados.head()

          Tipo           Bairro  Quartos  ...  IPTU  Valor m2  Tipo Agregado
0    Quitinete       Copacabana        1  ...  60.0     42.50    Apartamento
1         Casa  Jardim Botânico        2  ...   0.0     70.00           Casa
2  Apartamento           Centro        1  ...  20.0     53.33    Apartamento
3  Apartamento     Higienópolis        1  ...   0.0     16.67    Apartamento
5  Apartamento         Cachambi        2  ...  17.0     26.00    Apartamento

[5 rows x 11 columns]

In [ ]:
dados.to_csv('/content/aluguel_residencial_tratado_2.csv', sep = ';')

## (EXTRA) Contadores

In [ ]:
 s = pd.Series(list('asdadeadesdasesda'))
 s

0     a
1     s
2     d
3     a
4     d
5     e
6     a
7     d
8     e
9     s
10    d
11    a
12    s
13    e
14    s
15    d
16    a
dtype: object

In [ ]:
s.unique

<bound method Series.unique of 0     a
1     s
2     d
3     a
4     d
5     e
6     a
7     d
8     e
9     s
10    d
11    a
12    s
13    e
14    s
15    d
16    a
dtype: object>

In [ ]:
s.value_counts()

a    5
d    5
s    4
e    3
dtype: int64

In [ ]:
dados = pd.read_csv('/content/aluguel_residencial_tratado.csv', sep = ";")

In [ ]:
dados

              Tipo                Bairro  Quartos  ...   Valor  Condominio  IPTU
0        Quitinete            Copacabana        1  ...  1700.0       500.0  60.0
1             Casa       Jardim Botânico        2  ...  7000.0         0.0   0.0
2      Apartamento                Centro        1  ...   800.0       390.0  20.0
3      Apartamento          Higienópolis        1  ...   800.0       230.0   0.0
4      Apartamento              Cachambi        2  ...  1300.0       301.0  17.0
...            ...                   ...      ...  ...     ...         ...   ...
21821  Apartamento                 Méier        2  ...   900.0       490.0  48.0
21822    Quitinete                Centro        0  ...   800.0       350.0  25.0
21823  Apartamento           Jacarepaguá        3  ...  1800.0       800.0  40.0
21824  Apartamento  São Francisco Xavier        2  ...  1400.0       509.0  37.0
21825  Apartamento                Leblon        2  ...  3000.0       760.0   0.0

[21826 rows x 9 columns]

In [ ]:
dados['Tipo'].unique()

array(['Quitinete', 'Casa', 'Apartamento', 'Casa de Condomínio',
       'Casa de Vila'], dtype=object)

In [ ]:
dados['Tipo'].value_counts()

Apartamento           18780
Casa de Condomínio      996
Casa                    965
Quitinete               836
Casa de Vila            249
Name: Tipo, dtype: int64

## Exercício Moedas

In [ ]:
m1 = 'CCcCCccCCCccCcCccCcCcCCCcCCcccCCcCcCcCcccCCcCcccCc'
m2 = 'CCCCCccCccCcCCCCccCccccCccCccCCcCccCcCcCCcCccCccCc'
m3 = 'CccCCccCcCCCCCCCCCCcccCccCCCCCCccCCCcccCCCcCCcccCC'
m4 = 'cCCccCCccCCccCCccccCcCcCcCcCcCcCCCCccccCCCcCCcCCCC'
m5 = 'CCCcCcCcCcCCCcCCcCcCCccCcCCcccCccCCcCcCcCcCcccccCc'

In [ ]:
eventos = {
    'm1': list(m1),
    'm2': list(m2),
    'm3': list(m3),
    'm4': list(m4),
    'm5': list(m5)
}

In [ ]:
moedas = pd.DataFrame(eventos)

In [ ]:
moedas

   m1 m2 m3 m4 m5
0   C  C  C  c  C
1   C  C  c  C  C
2   c  C  c  C  C
3   C  C  C  c  c
4   C  C  C  c  C
5   c  c  c  C  c
6   c  c  c  C  C
7   C  C  C  c  c
8   C  c  c  c  C
9   C  c  C  C  c
10  c  C  C  C  C
11  c  c  C  c  C
12  C  C  C  c  C
13  c  C  C  C  c
14  C  C  C  C  C
15  c  C  C  c  C
16  c  c  C  c  c
17  C  c  C  c  C
18  c  C  C  c  c
19  C  c  c  C  C
20  c  c  c  c  C
21  C  c  c  C  c
22  C  c  C  c  c
23  C  C  c  C  C
24  c  c  c  c  c
25  C  c  C  C  C
26  C  C  C  c  C
27  c  c  C  C  c
28  c  c  C  c  c
29  c  C  C  C  c
30  C  C  C  c  C
31  C  c  c  C  c
32  c  C  c  C  c
33  C  c  C  C  C
34  c  c  C  C  C
35  C  C  C  c  c
36  c  c  c  c  C
37  C  C  c  c  c
38  c  c  c  c  C
39  c  C  C  C  c
40  c  C  C  C  C
41  C  c  C  C  c
42  C  C  c  c  C
43  c  c  C  C  c
44  C  c  C  C  c
45  c  C  c  c  c
46  c  c  c  C  c
47  c  c  c  C  c
48  C  C  C  C  C
49  c  c  C  C  c

In [ ]:
df = pd.DataFrame(data = ['Cara', 'Coroa'],
                  index = ['c', 'C'],
                  columns = ['Faces'])

In [ ]:
df

   Faces
c   Cara
C  Coroa

In [ ]:
for item in moedas:
  df = pd.concat([df, moedas[item].value_counts()], axis = 1)

In [ ]:
df

   Faces  m1  m2  m3  m4  m5
c   Cara  25  26  19  23  25
C  Coroa  25  24  31  27  25

In [ ]:
for item in moedas:
  print(item)

m1
m2
m3
m4
m5